libs/nx_onvif/src/xml/DeviceBinding.SetNetworkInterfaces.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:saml1="urn:oasis:names:tc:SAML:1.0:assertion"
    xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
    xmlns:wsc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsdd5="http://tempuri.org/wsdd5.xsd"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:xmime="http://tempuri.org/xmime.xsd"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
    xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2"
    xmlns:onvifAnalytics-aeb="http://www.onvif.org/ver20/analytics/wsdl/AnalyticsEngineBinding"
    xmlns:onvifAnalytics-reb="http://www.onvif.org/ver20/analytics/wsdl/RuleEngineBinding"
    xmlns:onvifAnalytics="http://www.onvif.org/ver20/analytics/wsdl"
    xmlns:onvifDevice="http://www.onvif.org/ver10/device/wsdl"
    xmlns:onvifDeviceIO="http://www.onvif.org/ver10/deviceIO/wsdl"
    xmlns:onvifEvents-cpb="http://www.onvif.org/ver10/events/wsdl/CreatePullPointBinding"
    xmlns:onvifEvents-eb="http://www.onvif.org/ver10/events/wsdl/EventBinding"
    xmlns:onvifEvents-ncb="http://www.onvif.org/ver10/events/wsdl/NotificationConsumerBinding"
    xmlns:onvifEvents-npb="http://www.onvif.org/ver10/events/wsdl/NotificationProducerBinding"
    xmlns:onvifEvents-ppb="http://www.onvif.org/ver10/events/wsdl/PullPointBinding"
    xmlns:onvifEvents="http://www.onvif.org/ver10/events/wsdl"
    xmlns:onvifEvents-pps="http://www.onvif.org/ver10/events/wsdl/PullPointSubscriptionBinding"
    xmlns:onvifEvents-psmb="http://www.onvif.org/ver10/events/wsdl/PausableSubscriptionManagerBinding"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:onvifEvents-smb="http://www.onvif.org/ver10/events/wsdl/SubscriptionManagerBinding"
    xmlns:onvifImg="http://www.onvif.org/ver20/imaging/wsdl"
    xmlns:onvifMedia="http://www.onvif.org/ver10/media/wsdl"
    xmlns:onvifMedia2="http://www.onvif.org/ver20/media/wsdl"
    xmlns:onvifNetwork-dlb="http://www.onvif.org/ver10/network/wsdl/DiscoveryLookupBinding"
    xmlns:onvifNetwork-rdb="http://www.onvif.org/ver10/network/wsdl/RemoteDiscoveryBinding"
    xmlns:onvifNetwork="http://www.onvif.org/ver10/network/wsdl"
    xmlns:onvifPtz="http://www.onvif.org/ver20/ptz/wsdl">
 <!-- struct SOAP_ENV__Header *soap::header -->
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
  <!-- __onvifDevice__SetNetworkInterfaces(..., _onvifDevice__SetNetworkInterfaces *onvifDevice__SetNetworkInterfaces, ...) -->
   <!-- _onvifDevice__SetNetworkInterfaces *onvifDevice__SetNetworkInterfaces -->
   <onvifDevice:SetNetworkInterfaces>
    <!-- std::string InterfaceToken -->
    <onvifDevice:InterfaceToken></onvifDevice:InterfaceToken>
    <!-- tt__NetworkInterfaceSetConfiguration *NetworkInterface -->
    <onvifDevice:NetworkInterface>
     <!-- bool *Enabled -->
     <tt:Enabled>false</tt:Enabled>
     <!-- tt__NetworkInterfaceConnectionSetting *Link -->
     <tt:Link>
      <!-- bool AutoNegotiation -->
      <tt:AutoNegotiation>false</tt:AutoNegotiation>
      <!-- int Speed -->
      <tt:Speed>0</tt:Speed>
      <!-- tt__Duplex Duplex -->
      <tt:Duplex>Full</tt:Duplex>
     </tt:Link>
     <!-- int *MTU -->
     <tt:MTU>0</tt:MTU>
     <!-- tt__IPv4NetworkInterfaceSetConfiguration *IPv4 -->
     <tt:IPv4>
      <!-- bool *Enabled -->
      <tt:Enabled>false</tt:Enabled>
      <!-- std::vector<tt__PrefixedIPv4Address *> Manual -->
      <!-- a repetition of 0 or more of the following -->
      <tt:Manual>
       <!-- std::string Address -->
       <tt:Address></tt:Address>
       <!-- int PrefixLength -->
       <tt:PrefixLength>0</tt:PrefixLength>
      </tt:Manual>
      <!-- bool *DHCP -->
      <tt:DHCP>false</tt:DHCP>
     </tt:IPv4>
     <!-- tt__IPv6NetworkInterfaceSetConfiguration *IPv6 -->
     <tt:IPv6>
      <!-- bool *Enabled -->
      <tt:Enabled>false</tt:Enabled>
      <!-- bool *AcceptRouterAdvert -->
      <tt:AcceptRouterAdvert>false</tt:AcceptRouterAdvert>
      <!-- std::vector<tt__PrefixedIPv6Address *> Manual -->
      <!-- a repetition of 0 or more of the following -->
      <tt:Manual>
       <!-- std::string Address -->
       <tt:Address></tt:Address>
       <!-- int PrefixLength -->
       <tt:PrefixLength>0</tt:PrefixLength>
      </tt:Manual>
      <!-- tt__IPv6DHCPConfiguration *DHCP -->
      <tt:DHCP>Auto</tt:DHCP>
     </tt:IPv6>
     <!-- tt__NetworkInterfaceSetConfigurationExtension *Extension -->
     <tt:Extension>
      <!-- std::vector<struct soap_dom_element> __any -->
      <!-- a repetition of 0 or more of the following -->

      <!-- std::vector<tt__Dot3Configuration *> Dot3 -->
      <!-- a repetition of 0 or more of the following -->
      <tt:Dot3>
       <!-- std::vector<struct soap_dom_element> __any -->
       <!-- a repetition of 0 or more of the following -->

      </tt:Dot3>
      <!-- std::vector<tt__Dot11Configuration *> Dot11 -->
      <!-- a repetition of 0 or more of the following -->
      <tt:Dot11>
       <!-- xsd__hexBinary SSID -->
       <tt:SSID></tt:SSID>
       <!-- tt__Dot11StationMode Mode -->
       <tt:Mode>Ad-hoc</tt:Mode>
       <!-- std::string Alias -->
       <tt:Alias></tt:Alias>
       <!-- std::string Priority -->
       <tt:Priority>0</tt:Priority>
       <!-- tt__Dot11SecurityConfiguration *Security -->
       <tt:Security>
        <!-- tt__Dot11SecurityMode Mode -->
        <tt:Mode>None</tt:Mode>
        <!-- tt__Dot11Cipher *Algorithm -->
        <tt:Algorithm>CCMP</tt:Algorithm>
        <!-- tt__Dot11PSKSet *PSK -->
        <tt:PSK>
        </tt:PSK>
        <!-- std::string *Dot1X -->
        <tt:Dot1X></tt:Dot1X>
        <!-- tt__Dot11SecurityConfigurationExtension *Extension -->
        <tt:Extension>
        </tt:Extension>
       </tt:Security>
       <!-- std::vector<struct soap_dom_element> __any -->
       <!-- a repetition of 0 or more of the following -->

      </tt:Dot11>
      <!-- tt__NetworkInterfaceSetConfigurationExtension2 *Extension -->
      <tt:Extension>
       <!-- std::vector<struct soap_dom_element> __any -->
       <!-- a repetition of 0 or more of the following -->

      </tt:Extension>
     </tt:Extension>
    </onvifDevice:NetworkInterface>
   </onvifDevice:SetNetworkInterfaces>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
